Tekla.Structures.Drawing.DrawingColors
The colors used in Tekla.Structures.Drawing.

Tekla.Structures.Drawing.DrawingColors.Invisible
The light gray color: the "invisible color". Light gray is visible
only on the screen and not in printed or exported drawings.

Tekla.Structures.Drawing.DrawingColors.Black
The black color.

Tekla.Structures.Drawing.DrawingColors.NewLine1
The brown color.

Tekla.Structures.Drawing.DrawingColors.NewLine2
The green color.

Tekla.Structures.Drawing.DrawingColors.NewLine3
The dark blue color.

Tekla.Structures.Drawing.DrawingColors.NewLine4
The forest green color.

Tekla.Structures.Drawing.DrawingColors.NewLine5
The orange color.

Tekla.Structures.Drawing.DrawingColors.NewLine6
The gray color.

Tekla.Structures.Drawing.DrawingColors.Red
The red color.

Tekla.Structures.Drawing.DrawingColors.Green
The bright green color.

Tekla.Structures.Drawing.DrawingColors.Blue
The blue color.

Tekla.Structures.Drawing.DrawingColors.Cyan
The turquoise color.

Tekla.Structures.Drawing.DrawingColors.Yellow
The yellow color.

Tekla.Structures.Drawing.DrawingColors.Magenta
The magenta color.

Tekla.Structures.Drawing.DrawingColors.Gray30
The Gray30 rgb(0.3, 0.3, 0.3) color.

Tekla.Structures.Drawing.DrawingColors.Gray50
The Gray50 rgb(0.5, 0.5, 0.5) color.

Tekla.Structures.Drawing.DrawingColors.Gray70
The Gray70 rgb(0.7, 0.7, 0.7) color.

Tekla.Structures.Drawing.DrawingColors.Gray90
The Gray90 rgb(0.9, 0.9, 0.9) color.